'use strict';
export default {
    "exp": [{
            label: "匹配非负整数",
            value: "^d+$"
        },
        {
            label: "匹配正整数",
            value: "^[0-9]*[1-9][0-9]*$"
        },
        {
            label: "匹配非正整数",
            value: "^((-d+)|(0+))$"
        },
        {
            label: "匹配数字,字母",
            value: "^\\w+$"
        },
        {
            label: "匹配数字,字母,下划线,中文",
            value: "^[\\w\\u4e00-\\u9fa5-_]+$"
        },
        {
            label: "匹配负整数",
            value: "^-[0-9]*[1-9][0-9]*$"
        },
        {
            label: "匹配整数",
            value: "^-?d+$"
        },
        {
            label: "匹配非负浮点数",
            value: "^d+(.d+)?$"
        },
        {
            label: "匹配正浮点数",
            value: "^(([0-9]+.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*.[0-9]+)|([0-9]*[1-9][0-9]*))$"
        },
        {
            label: "匹配非正浮点数",
            value: "^((-d+(.d+)?)|(0+(.0+)?))$"
        },
        {
            label: "匹配负浮点数",
            value: "^(-(([0-9]+.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*.[0-9]+)|([0-9]*[1-9][0-9]*)))$"
        },
        {
            label: "匹配浮点数",
            value: "^(-?d+)(.d+)?$"
        },
        {
            label: "匹配英文字母",
            value: "^[A-Za-z]+$"
        },
        {
            label: "匹配英文字母大写",
            value: "^[A-Z]+$"
        },
        {
            label: "匹配英文字母小写",
            value: "^[a-z]+$"
        },
        {
            label: "匹配由数字和英文",
            value: "^[A-Za-z0-9]+$"
        },
        {
            label: "匹配由数字和英文或下划线",
            value: "^w+$"
        },
        {
            label: "匹配email地址",
            value: "^[w-]+(.[w-]+)*@[w-]+(.[w-]+)+$"
        },
        {
            label: "匹配url",
            value: "^[a-zA-z]+:"
        },
        {
            label: "匹配中文字符",
            value: "[u4e00-u9fa5]"
        },
        {
            label: "匹配双字节字符",
            value: "[^x00-xff]"
        },
        {
            label: "不能为空,空格,只能是英文",
            value: "^S+[a-z A-Z]$"
        }
    ]
}